# handling missing value

In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [5]:
dataset = pd.read_csv(r"C:\Users\Avishank Dwivedi\OneDrive\Desktop\Data.csv")
dataset.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [19]:

dataset["Salary"].fillna(dataset["Salary"].mode(),inplace=True)

In [20]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     10 non-null     float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 452.0+ bytes

In [22]:
dataset.select_dtypes(include='float64').columns

Index(['Age', 'Salary'], dtype='object')

In [23]:
from sklearn.impute import SimpleImputer

In [26]:
si = SimpleImputer(strategy ="mean")
ar = si.fit_transform(dataset[['Age', 'Salary']])

In [28]:
newdataset = pd.DataFrame(ar,columns=dataset.select_dtypes(include="float64").columns)

In [29]:
newdataset.isnull().sum()

Age       0
Salary    0
dtype: int64

         Age   Salary
0  44.000000  72000.0
1  27.000000  48000.0
2  30.000000  54000.0
3  38.000000  61000.0
4  40.000000  61000.0
5  35.000000  58000.0
6  38.777778  52000.0
7  48.000000  79000.0
8  50.000000  83000.0
9  37.000000  67000.0